#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vishal6237/kubernetes-ops-staging-helm-external-dns/runs/run-UzStb19VZYFXeJaz

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.external-dns.aws_iam_policy.iam_policy will be created
  + resource "aws_iam_policy" "iam_policy" {
      + arn         = (known after apply)
      + description = "EKS external-dns policy for cluster staging"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "external-dns-staging"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "route53:ChangeResourceRecordSets"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::hostedzone/Z06741673Q2CL42WOHW5H"
                      + Sid      = "k8sExternalDNS"
                    },
                  + {
                      + Action   = [
                          + "route53:ListResourceRecordSets",
                          + "route53:ListHostedZones",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "k8sExternalDNS2"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.external-dns.module.external-dns.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "external-dns"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/external-dns/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ---
                serviceAccount:
                  # Specifies whether a service account should be created
                  create: true
                  # Annotations to add to the service account
                  annotations:
                    # This value should match the ARN of the role created by module.iam_assumable_role_admin in irsa.tf
                    eks.amazonaws.com/role-arn: "arn:aws:iam::980108187232:role/external-dns-staging"
                  # The name of the service account to use.
                  # If not set and create is true, a name is generated using the fullname template
                  name: external-dns
            EOT,
          + <<-EOT
                ---
                sources:
                  - service
                  - ingress
                  # # Enabling external-dns to watch for hostnames in these resources to add DNS entries
                  # # This PR has to be merged before the external-dns will have permissions to watch the istio resources
                  # # https://github.com/kubernetes-sigs/external-dns/pull/2248
                  # # To enable this, you need to add the following to the clusterrole: external-dns
                  # # - apiGroups: ["networking.istio.io"]
                  # #   resources: ["gateways", "virtualservices"]
                  # #   verbs: ["get","watch","list"]
                  # # Then you can enable the following or external-dns will crash
                  # - istio-gateway
                  # - istio-virtualservice
            EOT,
        ]
      + verify                     = false
      + version                    = "1.2.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.external-dns.module.iam_assumable_role_admin.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-2.amazonaws.com/id/D2800DE9240CE4F75E852B3CB8E4129C:sub" = "system:serviceaccount:external-dns:external-dns"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::980108187232:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/D2800DE9240CE4F75E852B3CB8E4129C"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "external-dns-staging"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.external-dns.module.iam_assumable_role_admin.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "external-dns-staging"
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```


</details>

*Pusher: @vishal6237, Action: `pull_request`*